init-w3m.org

;; added for w3m				

 ;; (if (= emacs-major-version 23)
 ;;    (progn
 ;;      (add-to-list 'load-path "~/efficient_workspace/emacs_extensions/emacs-w3m-1.4.4/share/emacs/site-lisp/w3m")
 ;;      (require 'w3m-load))
 ;;  (require 'w3m))
(add-to-list 'load-path "/usr/local/libexec/w3m")
(add-to-list 'load-path "/usr/share/emacs/site-lisp/w3m")
(require 'w3m-load)
(require 'mime-w3m)			

;; set w3m as standard browser
#+BEGIN_SRC 
(setq browse-url-browser-function 'w3m-browse-url)
#+END_SRC


;; allow easy toggling between w3m and normal buffers
;; [[http://sachachua.com/blog/category/wickedcoolemacs/][Taken from Sacha Chua]]
#+BEGIN_SRC emacs-lisp
(defun wicked/toggle-w3m ()
  "Switch to a w3m buffer or return to the previous buffer."
  (interactive)
  (if (derived-mode-p 'w3m-mode)
      ;; Currently in a w3m buffer
      ;; Bury buffers until you reach a non-w3m one
      (while (derived-mode-p 'w3m-mode)
	(bury-buffer))
    ;; Not in w3m
    ;; Find the first w3m buffer
    (let ((list (buffer-list)))
      (while list
	(if (with-current-buffer (car list)
	      (derived-mode-p 'w3m-mode))
	    (progn
	      (switch-to-buffer (car list))
	      (setq list nil))
	  (setq list (cdr list))))
      (unless (derived-mode-p 'w3m-mode)
	(call-interactively 'w3m)))))
(global-set-key (kbd "<f7>") 'wicked/toggle-w3m)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (define-key w3m-mode-map (kbd "M-n") 'forward-word)
#+END_SRC


;; ;; added for translate-and-export macro
;; (fset 'translate-and-export
;;    [?\M-f ?\M-b ?\C-  ?\M-f ?\M-w ?\M-e ?\C-  ?\M-x ?b ?a ?c ?k ?w ?a ?r ?d ?- ?s ?e ?n ?t ?e ?n ?c ?e return ?\M-x ?s ?e ?a ?r ?c ?h ?- ?f ?o ?r ?w ?a ?r ?d ?- ?r ?e ?g ?e ?x ?p return ?\[ ?a ?: backspace ?- ?u backspace ?z ?| ?A ?- ?Z return ?\C-b ?\M-w ?\C-x ?\C-f ?~ ?/ ?o ?r ?g ?/ ?r ?s ?s ?/ ?v ?o ?c ?a ?b ?u ?l ?a ?r ?y ?. ?o ?r ?g return ?\M-> ?\C-r ?| ?\C-m ?\C-f ?\C-  ?\M-> ?\C-d return ?| ?\C-y ?\M-y tab ?\C-x ?r ?m ?v ?o ?c ?a ?b ?_ ?m ?e ?a ?n ?i ?n ?g return tab ?\C-x ?r ?m ?v ?o ?c ?a ?b ?_ ?s ?e ?n ?t ?e ?n ?c ?e return ?\M-x ?s ?e ?t ?- ?v ?a ?r ?i ?a ?b ?l ?e return ?f ?i ?l ?l ?- ?c ?o ?l ?u ?m ?n return ?5 ?0 return ?\C-e return return ?\C-x ?r ?m ?v ?o ?c ?a ?b ?_ ?t ?a ?b ?l ?e ?e ?n ?d return ?\C-y ?\C-u ?- ?1 ?\M-y ?\C-  ?\C-x ?r ?b ?v ?o ?c ?a ?b ?_ ?t ?a ?b ?l ?e ?e ?n ?d return ?\M-q ?\C-  ?\C-x ?r ?b ?v ?o ?c ?a ?b ?_ ?t ?a ?b ?l ?e ?e ?n ?d return ?\C-u ?1 ?0 ?\C-u ?\C-c ?| ?\C-  ?\C-  ?\C-p return ?\C-x ?r ?m ?v ?o ?c ?a ?b ?_ ?t ?a ?b ?l ?e ?e ?n ?d return ?\C-u ?\C-  ?\C-  ?\M-> ?\C-r ?| ?\C-b ?\C-c ?\C-x ?\C-w ?\C-x ?r ?b ?v ?o ?c ?a ?b ?_ ?t ?a ?b ?l ?e ?e ?n ?d return ?\C-  ?\M-> ?\C-d ?\C-x ?r ?b ?v ?o ?c ?a ?b ?_ ?s ?e ?n ?t ?e ?n ?c ?e return ?\C-c ?\C-x ?\C-y ?\M-x ?g ?o ?o ?g ?l ?e ?- ?t ?r ?a ?n ?s ?l ?a ?t ?e return ?\C-y ?\M-y return ?\C-x ?o ?\C-n ?\C-n ?\C-n ?\C-n ?\C-  ?\C-e ?\M-w ?\C-x ?o ?\C-x ?r ?b ?v ?o ?c ?a ?b ?_ ?m ?e ?a ?i ?n backspace backspace ?n ?i ?n ?g return ?\C-y return ?\C-x ?o ?\C-n ?\C-a ?\C-  ?\C-e ?\M-w ?\C-x ?o ?\C-y return ?\C-x ?o ?\C-n ?\C-a ?\C-  ?\C-e ?\M-w ?\C-x ?o ?\C-y return ?\C-x ?o ?\C-n ?\C-a ?\C-  ?\C-e ?\M-w ?\C-x ?o ?\C-y ?\C-c ?\C-c ?\M-> ?\M-x ?s ?e ?a ?r ?c ?h ?- ?b ?a ?c ?k ?w ?a ?r ?d ?- ?r ?e ?g ?e ?x ?p return ?\[ ?a ?- ?z ?| ?A ?- ?Z return ?\C-e ?\M-> ?\C-r ?| ?\C-m ?\C-c ?- ?\C-x ?b return])

;; (global-set-key "\C-xt" 'translate-and-export)


;; set delete-by-moving-to-trash to t
;; C-M-f
;; M-s w isearch forward word
;; C-s C-w add word after point to isearch
;; C-x C-x jump between beginning and ending of yanked text
;; M-r move to top, center and bottom of screen
;; c-subword-mode for words like ThisIsWordWithSubwordCapitalisation
;; M-s o list occurrences in new buffer
;; M-x re-builder: interactively build regular expression

;; ;; (load "/usr/share/emacs/23.3/site-lisp/ess/ess-site")
;; (load "~/ESS/lisp/ess-site.el")
;; (require 'ess-site)
;; (setq inferior-julia-program-name "~/julia/julia-release-basic")
